process where event.type: "start" and 
process.name: "outlook.exe" and not
process.parent.executable: ("C:\\Program Files\\Common Files\\microsoft shared\\ClickToRun\\OfficeClickToRun.exe","C:\\Windows\\explorer.exe","C:\\Windows\\System32\\svchost.exe")

## If outlook.exe is spawned by a process which is not one of the above three it could indicate that a threat actor is exfiltrating data using email.
## Its normal for explorer.exe to be the parent process for outlook, svchost.exe has been excluded as it is used to auto-start outlook.exe on reboot.
